#include <iostream>
#include <string>
#include <cmath>
#include <tuple>
#include <algorithm>

using namespace std;

int main()
{
    /* 숫자 출력 자릿수 조절 */
    double a = 2, b = 4;

    cout << fixed;           // 소수점을 고정시켜서 출력
    cout.precision(15);      // 15자리까지 출력
    cout << a << endl        // 2.000000000000000
         << b << endl;       // 4.000000000000000
    cout.unsetf(ios::fixed); // 소수점 고정 해제
    cout << a << endl        // 2
         << b << endl;       // 4

    // -------------------------------------------------------------------------------------------------

    /* 형 변환, 형 변환을 통한 아스키코드 출력 */
    // static_cast<new_type>(expression)
    char ch = 'a';
    cout << static_cast<int>(ch) << endl; // ch를 int로 바꾸어 아스키코드 출력

    // -------------------------------------------------------------------------------------------------

    /* 공백있는 문자열 받기 */
    string str;
    getline(cin, str); // getline(cin, str, '\n')이지만 마지막은 생략해도 자동 적용

    // -------------------------------------------------------------------------------------------------

    /* 문자열을 정수형으로, 정수형을 문자열로 */
    //int a = 1, int_b;
    //char b = '5', char_a;

    //char_a = a + '0'; // '1', 정수형 + '0' = 문자열
    //int_b = b - '0';  // 5, 문자열 - '0' = 정수형

    //// string 헤더 파일 필요
    //string b = "5", str_a;
    //str_a = to_string(a); // '1', 정수형을 문자열로 변환
    //int_b = stoi(b);      // 5, 문자열을 정수형으로 변환

    // -------------------------------------------------------------------------------------------------

    /* 올림, 내림, 반올림 */
    // cmath 헤더를 불러와야 함

    double n1 = 4.7;
    printf("%0.1lf\n", ceil(n1));        // 5.0, 올림
    printf("%0.1lf\n", floor(n1));       // 4.0, 내림
    printf("%0.1lf\n", floor(n1 + 0.5)); // 5.0, 내림에 0.5를 더하여 만든 반올림

    // -------------------------------------------------------------------------------------------------

    /* auto 자료형 */
    // 초깃값의 형식에 맞춰 변수의 형식이 자동으로 결정

    auto d = 5.0;   // 소수가 들어갔으므로 double로 설정
    auto i = 1 + 2; // 정수형끼리의 덧셈이므로 int로 설정

    // -------------------------------------------------------------------------------------------------

    /* Tuple */
    // pair는 두 개의 값이라면 tuple은 세 개의 값을 저장

    tuple<string, string, int> mj;
    mj = make_tuple("Ko Myoung Jun", "1995-10-15", 27);
    cout << get<0>(mj) << '\n' // Ko Myoung Jun
         << get<1>(mj) << '\n' // 1995-10-15
         << get<2>(mj);        // 27
    cout << '\n';

    // -------------------------------------------------------------------------------------------------

    /* 배열 0으로 초기화 */
    int arr1[5] = {}; // 모두 0을 가지는 배열 생성

    // -------------------------------------------------------------------------------------------------

    /* fill 함수 */
    // algorithm 필요
    int arr[5] = {1, 2, 3, 4, 5};
    fill(arr, arr + 5, 10);
    for (int i = 0; i < 5; i++)
        cout << arr[i] << ' '; // 10 10 10 10 10
    cout << '\n';

    // -------------------------------------------------------------------------------------------------

    /* 대문자, 소문자 변환 / string 필요 */
    string str2 = "Hello World";
    for (int i = 0; i < str2.size(); i++)
        str2[i] = tolower(str2[i]);
    cout << str2 << '\n'; // hello world

    for (int i = 0; i < str2.size(); i++)
        str2[i] = toupper(str2[i]);
    cout << str2 << '\n'; // HELLO WORLD

    // -------------------------------------------------------------------------------------------------

    /* 조건문 한 줄로 쓰기 */
    int va = 30, x;
    if (va > 30)
        x = 100;
    else
        x = 0;

    cout << x << '\n'; // 0

    x = (va > 30) ? 100 : 0;
    cout << x << '\n'; // 0

    // -------------------------------------------------------------------------------------------------
    return 0;
}